In [1]:
import os
import sys
import glob

import numpy as np
import pandas as pd

In [2]:
# set up the file
filepath = "/home/users/benhutch/unseen_multi_year/dfs/ERA5_UK_mean_temp_hourly_1990-2020.csv"

In [3]:
# load the df
df = pd.read_csv(filepath)

In [4]:

df.head()

            Unnamed: 0  United Kingdom_t2m
0  1990-01-01 00:00:00            3.655701
1  1990-01-01 01:00:00            3.741577
2  1990-01-01 02:00:00            3.829864
3  1990-01-01 03:00:00            4.033020
4  1990-01-01 04:00:00            4.181671

In [5]:
# set Unnamed: 0 as datetime
df['Unnamed: 0'] = pd.to_datetime(df['Unnamed: 0'])

# set Unnamed: 0 as index
df.set_index('Unnamed: 0', inplace=True)

# remove the name of the index
df.index.name = None

In [6]:
df.head()

                     United Kingdom_t2m
1990-01-01 00:00:00            3.655701
1990-01-01 01:00:00            3.741577
1990-01-01 02:00:00            3.829864
1990-01-01 03:00:00            4.033020
1990-01-01 04:00:00            4.181671

In [7]:
# subset to JJA (UK summer)
df_jja = df[(df.index.month >= 6) & (df.index.month <= 8)]

In [9]:
df_jja.tail()

                     United Kingdom_t2m
2020-08-31 19:00:00           13.147125
2020-08-31 20:00:00           11.751373
2020-08-31 21:00:00           10.894440
2020-08-31 22:00:00           10.089111
2020-08-31 23:00:00            9.454742

In [10]:
# add a new column for the hour of day
df_jja['hour'] = df_jja.index.hour

/tmp/ipykernel_15151/3034195900.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_jja['hour'] = df_jja.index.hour

In [12]:
df_jja.tail()

                     United Kingdom_t2m  hour
2020-08-31 19:00:00           13.147125    19
2020-08-31 20:00:00           11.751373    20
2020-08-31 21:00:00           10.894440    21
2020-08-31 22:00:00           10.089111    22
2020-08-31 23:00:00            9.454742    23

In [13]:
# calculate the average temperature for each hour of the day
df_jja_hourly = df_jja.groupby('hour').mean()

In [14]:
df_jja_hourly

      United Kingdom_t2m
hour
0              12.647414
1              12.377531
2              12.123493
3              11.967268
4              11.893330
5              12.059977
6              12.673667
7              13.347833
8              14.208129
9              14.956351
10             15.980948
11             16.473353
12             16.883169
13             17.168204
14             17.350353
15             17.348432
16             17.209734
17             16.880285
18             16.355223
19             15.742158
20             14.853368
21             14.147561
22             13.341357
23             12.975103

In [15]:
# set hour as a column
df_jja_hourly.reset_index(inplace=True)

In [16]:
df_jja_hourly.head()

   hour  United Kingdom_t2m
0     0           12.647414
1     1           12.377531
2     2           12.123493
3     3           11.967268
4     4           11.893330

In [17]:
# save the df
df_jja_hourly.to_csv("/home/users/benhutch/unseen_multi_year/dfs/ERA5_UK_mean_hourly_temp_JJA_1990-2020.csv", index=False)